{"pageProps":{"post":{"title":"What is your Hairy Potter Problem?","date":"2023-11-14T12:25:07.322Z","slug":"what-is-your-hpp","author":{"name":"Maarten Ectors","picture":"/assets/blog/authors/maarten.png"},"content":"<p>A <strong>Hairy Problem</strong> is a critical business problem which needs to be resolved. It is like a toothache, not a vitamin. There are two types of Hairy Problems. The ones where you just need the money and time to resolve them. We are not interested in those. Call your preferred consultancy company and they will happely solve them. The other one are Hairy Potter Problems. You either have tried multiple times and failed or don't even know where to start. The only solution is to find an innovator with a magic wand and make your Hairy Problem go away. Hence the name <strong>Hairy Potter Problem</strong>.</p>\n<p>We cannot solve all Hairy Potter Problems and we don't pretend we will. Our objective is too fail cheaper and faster than anybody else. So if you want all wars to stop in the world, then we can fail very fast. We unfortunately don't have the solution. That just saved you millions. A top strategic consulting company would probably have told you the same after some months and a big bill.</p>\n<h2>So which Hairy Potter Problem can be solved?</h2>\n<p>Profit Growing Innovator has been in the business of solving Hairy Potter Problems for some time. Key employees have over two decades of experience, solving Hairy Potter Problems [HPP]. Some examples:</p>\n<ul>\n<li>\n<p>In 2009 Nokia (Siemens) Networks was struggling to quickly bring exciting new products to market. Through the creation of the first telecom cloud incubator, 6 prototypes were created in 2 months, 5 were piloted with customers, 4 products were launched the same year, 3 companies were spun-off, Software AG acquired Cumulocity, the first IoT SaaS platform, and is still using it. Startups@NSN was Maarten Ectors ' idea and he was vital in launching the first prototypes and customer pilots. Several of his ideas were awarded patents and one won the best telecom cloud solution award.</p>\n</li>\n<li>\n<p>In 2014 Canonical, the company behind Ubuntu, had a failing Ubuntu phone team that was bleeding money. Maarten had just taught the cloud sales team how to sell Ubuntu and Juju to telecom [now the biggest revenue generator]. He came up and launched Snappy Ubuntu Core [and he did not invent the name :-)] which in 2015 won the award for best innovation of the year. He worked with the team and sold IoT solutions to Intel, Dell, Bosch,... Now Ubuntu's IoT business unit is their second biggest revenue-generator.</p>\n</li>\n<li>\n<p>At Legal &#x26; General [UK #1 investment manager and insurer] several HPPs were solved, from how to make household claims easy for honest customers and hard for dishonest customers [SmartClaim won the award for best claim technology platform of 2018, L&#x26;Gs first technology award in its 185 history]; how to scale the reinsurance business in Bermuda without hiring more people [world's first reinsurance on blockchain], how to engage employees with their pension [Coll8 quadrupled digital engagement, brought in many large workplace pension customers and made the workplace pension team pension tech firm of 2020].</p>\n</li>\n<li>\n<p>Profit Growing Innovator since 2021 has been helping many AI, Web3, DeFi, IoT, GreenTech, Spacial / GameMedia,... startups innovate, launch exciting new products,...</p>\n</li>\n</ul>\n<h2>What is your Hairy Potter Problem?</h2>\n<p>We offer free consulting for you to tell us your Hairy Potter Problem, to reflect on a potential strategy to revolve it and to share our resolution plan. If you have a HPP, budget and want to resolve it, fill out our <a href=\"https://forms.gle/AVe73hV4o35AnsFr5\">free consulting form</a>.</p>\n","ogImage":{"url":"/assets/blog/dynamic-routing/cover.jpg"},"coverImage":"/assets/blog/dynamic-routing/cover.jpg"}},"__N_SSG":true}